app/views/questions/_form.html.erb

SELECT `answers`.* FROM `answers`
---

      <% @question.answers.each do |answer| %>