app/views/questions/show.html.erb

        <strong>Resposta certa:</strong>
        <%= @question.correct_answer.title unless @question.correct_answer.blank? %>
---
SELECT  `answers`.* FROM `answers`  WHERE `answers`.`correct_answer_id` = 1 LIMIT 1