app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT `answers`.* FROM `answers`

  def new
    @answer = Answer.new
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

  def edit
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save
---
INSERT INTO `answers` (`created_at`, `subject_id`, `title`, `updated_at`) VALUES ('2014-10-31 23:04:59', 2, 'AUHEUAHEUAHE', '2014-10-31 23:04:59')

    def set_answer
      @answer = Answer.find(params[:id])
---
SELECT  `answers`.* FROM `answers`  WHERE `answers`.`id` = 2 LIMIT 1