app/controllers/integrations_controller.rb

SELECT `subjects`.* FROM `subjects`
SELECT `questions`.* FROM `questions`  WHERE `questions`.`subject_id` IS NULL
SELECT `answers`.* FROM `answers`  WHERE `answers`.`subject_id` IS NULL
---
  def set_objects
    @subjects = Subject.all
    @questions = Question.where(subject_id: params[:subject_id])
    @answers = if params.has_key?(:question_id) and params[:question_id] != ''
                 Answer.where(subject_id: params[:subject_id])