app/controllers/questions_controller.rb

SELECT `subjects`.* FROM `subjects`
---
  def new
    @question = Question.new
    @subjects = Subject.all

SELECT `subjects`.* FROM `subjects`
---
  def edit
    @subjects = Subject.all

INSERT INTO `questions` (`created_at`, `description`, `subject_id`, `updated_at`) VALUES ('2014-11-02 11:51:03', 'ASDKASJDKJAS JDASJD ASJVASJFHASFJASVFHAVGFA', 3, '2014-11-02 11:51:03')
---
  def create
    @question = Question.new(question_params)

    params[:question][:answers_attributes].map do |k, v|
      @question.answers << Answer.new(title: v[:title], question_id: @question.id,
                                      is_correct: v[:is_correct])

UPDATE `questions` SET `description` = 'AUHDUADU AUDHAU DHUA SHDUASDHuhs', `updated_at` = '2014-10-31 23:54:42' WHERE `questions`.`id` = 2
---
  def update
    #.map do |k, v|
      @question.answers.update(params[:question][:answers_attributes])

SELECT  `questions`.* FROM `questions`  WHERE `questions`.`id` = 2 LIMIT 1
---
  def set_question
    @question = Question.find(params[:id])