app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO `subjects` (`created_at`, `title`, `updated_at`) VALUES ('2014-10-31 22:47:18', 'Sistemas de arquivos', '2014-10-31 22:47:18')

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 1 LIMIT 1